000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. LOOP.
000300
000400 DATA DIVISION. 
000500 WORKING-STORAGE SECTION. 
000600 01 COUNTER PIC 9(2) VALUE 1.
000700
000800 PROCEDURE DIVISION.
000900     PERFORM VARYING COUNTER FROM 1 BY 1 UNTIL COUNTER > 10
001000        DISPLAY "COUNTER: " COUNTER
001100     END-PERFORM
001200     STOP RUN.
001300
001400     