000100 IDENTIFICATION DIVISION. 
000200 PROGRAM-ID. SUM2NUM.
000300
000400 ENVIRONMENT DIVISION. 
000500
000600 DATA DIVISION. 
000700 WORKING-STORAGE SECTION. 
000800 01 NUM1 PIC 9(3) VALUE 100.
000900 01 NUM2 PIC 9(3) VALUE 50.
001000
001100 PROCEDURE DIVISION.
001200     PERFORM CALCULATE-SUM
001300     DISPLAY "SUM: " NUM1
001400     STOP RUN.
001500
001600 CALCULATE-SUM.
001700     ADD NUM2 TO NUM1.
001800